[{"name": "usd", "buy": "86.20", "sell": "86.55"},
    {"name": "eur", "buy": "91.50", "sell": "91.30"}, {
    "name": "rub",
    "buy": "0.870",
    "sell": "0.880"
}, {"name": "kzt", "buy": "0.1250", "sell": "0.1770"}]

Мне нужно функция которая обединяет две два однаковых массива как происходит

первый массив курс средних валют
второй курс лучшиъ валют мне нужно что бы сделал их них один такой массив

    [
        {
            "name":"usd",
            "averageBuy":"86.20",
            "averageSell":"86.55",
            "bestBuy":"86.20",
            "bestSell":"86.55",
        }
    ]